target/test-classes/xml/ocs/TC5339_Multi_Deal_OCS_CCA_Consumer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ord="http://order.telco.hsntech.com">
   <soapenv:Header/>
   <soapenv:Body>
      <ord:createOrder correlationId="" type="NEW" provisioningSystem="OCS">
         <account type="RESIDENTIAL">
            <contact type="BILLING" language="en_GB">
               <title>Ms</title>
               <firstName>Sky</firstName>
               <lastName>QQHPINdev030</lastName>
               <telephoneNumbers defaultContact="daytime">
                  <daytime>0398403850</daytime>
                  <evening>0208619999</evening>
                  <mobile>02086999990</mobile>
               </telephoneNumbers>
               <emailAddress>QQHPINdev029@gmail.com</emailAddress>
               <birthDate>1990-01-01Z</birthDate>
            </contact>
            <billingAddress>
               <buildingIdentifier>3</buildingIdentifier>
               <addressLine1>Joseph Place</addressLine1>
               <addressLine2>Hartville</addressLine2>
               <town>London</town>
               <country>Australia</country>
               <postcode>VC3132</postcode>
               <ptc_abs_code>PTCABS31116177</ptc_abs_code>
               <startDate>1980-08-08</startDate>
            </billingAddress>
            <accountDetail>
               <username>QQHPINdev029</username>
               <password>Password01</password>
               <securityQuestion>Mothers maiden name?</securityQuestion>
               <securityAnswer>ray</securityAnswer>
            </accountDetail><businessDetail><businessName>Sunrise</businessName></businessDetail>
            <billingDetail>
               <billGroupId>906</billGroupId>
               <preferredNotification>SMS</preferredNotification>
               <paymentDetail type="CARD">
                  <creditCard>
                     <cardName>Card</cardName>
                     <cardNumber>4111111111111111</cardNumber>
                     <cardType>MC</cardType>
                     <cardExpiryDate>0124</cardExpiryDate>
                     <cvv>123</cvv>
                  </creditCard>
               </paymentDetail>
               <billFormat>SUMMARY</billFormat>
               <clubcardNumber>634143330730912784</clubcardNumber>
            </billingDetail>
         </account>
         <verification runCreditCheck="false" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="false">
            <interconnect>
               <param name="PAYASYOUGO"/>
            </interconnect>
         </verification>
         <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Care (CSA)" agentId="Carla" externalSystemID="COCO" paymentMethod="CARD">
            <dateTime>2011-06-10T16:44:31.0Z</dateTime>
            <orderItem id="1" masterSubscription="true" dealSKU="DEAL-100">
               <serviceRef reference="Mobile 1"/>
               <tariff productCode="FC24-3000-1000-M1">
                  <deliveryMethod>INHAND</deliveryMethod>
               </tariff>
               <device productCode="AP725SV-24-2950-180">
                  <deliveryMethod>DELIVER</deliveryMethod>
                  <imei>294902255729057</imei>
                  <serialNumber>123152436457568486784684</serialNumber>
                  <agreement provider="AGRTESCOMOBILE"/>
               </device>
               <peripheral productCode="IPADMINI4-00-0000-50">
                  <deliveryMethod>DELIVER</deliveryMethod>
                  <agreement provider="AGRTESCOMOBILE"/>
               </peripheral>
               <discBundle bundleGroup="SB-GRP-B" billCapNotifications="false" productCode="00750-SB-B">
                  <deliveryMethod>INHAND</deliveryMethod>
               </discBundle>
            </orderItem>
            <orderItem id="2" dealSKU="DEAL-100">
               <serviceRef reference="Mobile 2"/>
               <tariff productCode="FC24-3000-1000-M1">
                  <deliveryMethod>INHAND</deliveryMethod>
               </tariff>
               <device productCode="AP725SV-24-2950-180">
                  <deliveryMethod>DELIVER</deliveryMethod>
                  <imei>294902255729057</imei>
                  <serialNumber>123152436457568486784684</serialNumber>
                  <agreement provider="AGRTESCOMOBILE"/>
               </device>
               <peripheral productCode="IPADMINI4-00-0000-50">
                  <deliveryMethod>DELIVER</deliveryMethod>
                  <agreement provider="AGRTESCOMOBILE"/>
               </peripheral>
               <discBundle bundleGroup="SB-GRP-B" billCapNotifications="false" productCode="00750-SB-B">
                  <deliveryMethod>INHAND</deliveryMethod>
               </discBundle>
            </orderItem>
            <paymentRequest>
               <cardName>Card</cardName>
               <cardNumber>4111111111111111</cardNumber>
               <cardType>MC</cardType>
               <cardExpiryDate>0124</cardExpiryDate>
               <cvv>123</cvv>
            </paymentRequest>
         </orderDetail>
      </ord:createOrder>
   </soapenv:Body>
</soapenv:Envelope>